// 1 task
// var x = 6, y = 15, z = 4;
// y /= x + 5 % z;

// Ответ: 2.142
// y /= x + 5 % z = y / ( x + 5 % z )
// 1) x + 5 % z = 6 + 5 % 4 = 7
// 2) 15 % 7 ~ 2.142

//console.log(y);


// 2 task
// var x = 6, y = 15, z = 4;
// z = x++ + y * 5;

// Ответ: 81
// z = x++ + y * 5 = x++ + y * 5;
// 1) y * 5 = 15 * 5 = 75
// 2) x++ = 6 (постфиксная форма возвращается старое значение)
// 3) 75 + 6 = 81

//console.log(z);


// 3 task
// var x = 6, y = 15, z = 4;
// x += y - x++ * z;

// Ответ: -3
//  x += y - x++ * z = x + ( y - x++ * z);
// 1) y - x++ * z = 15 - 6 * 4 = -9
// 2) x + (-9) = 6 - 9 = -3

//console.log(x);

// 4 task
// var x = 6, y = 15, z = 4;
// z = -- x - y * 5;

// Ответ: -70
// z = --x - y * 5;
// 1) y * 5 = 15 * 5 = 75
// 2) --x = x - 1 = 5 (префиксная форма возвращается новое значение)
// 3) 5 - 75 = -70

//console.log(z);


// 5 task
// var a = 3;
// var b = ++a + 1 + a++;

// Ответ: 8
// ++a = a + 1 = 3 + 1 = 4 (префиксная форма возвращается новое значение)
// a++ = 4 (префиксная форма возвращается cтарое значение)
// b = 4 + 1 + 4 = 9

///console.log(b)